redshield-backend/app/controllers/clients_controller.rb

SELECT "clients".* FROM "clients"
---
  def index
    @clients = Client.all

SELECT "clients".* FROM "clients" WHERE "clients"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_client
      @client = Client.find(params[:id])